export const postsMessages = {
  NOT_SELECTED_ID: () => `Не обрано жодного елементу`,
  STATUS_ERROR: id => `Зміна статусу продукту № ${id} невдала`,

  Deleting: {
    confirm: id => `Бажаєте видалити продукт № ${id} ?`,
    success: id => `Продукт № ${id} видалений`,
    error: id => `Видалення продукту № ${id} невдале`,
  },

  Visibility: {
    confirm: id => `Бажаєте змінити видимість продукту № ${id} ?`,
    changed: id => `Видимість продукту № ${id} змінена`,
    error: id => `Зміна видимості продукту № ${id} невдала`,
  },

  Approving: {
    confirm: id => `Бажаєте затвердити продукт № ${id} ?`,
    success: id => `Продукт № ${id} затверджений`,
    error: id => `Затвердження продукту № ${id} невдале`,
  },

  Rejecting: {
    confirm: id => `Бажаєте відхилити продукт № ${id} ?`,
    success: id => `Продукт № ${id} відхилено`,
    error: id => `Відхилення продукту № ${id} невдале`,
  },
};
